turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC4C.atdf
          </instance>
        </module>
        <module name="FREQM" id="I7530" version="3.1.1">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x400E0C00"/>
            <parameters>
              <param name="CPU" value="0"/>
              <param name="CRIPOSC" value="10"/>
              <param name="DFLL0" value="9"/>
              <param name="FLO_JITTER" value="27"/>
              <param name="GENCLK0" value="11"/>
              <param name="GENCLK1" value="12"/>
              <param name="GENCLK2" value="13"/>
              <param name="GENCLK3" value="14"/>
              <param name="GENCLK4" value="15"/>
              <param name="GENCLK5" value="16"/>
              <param name="GENCLK6" value="17"/>
              <param name="GENCLK7" value="18"/>
              <param name="GENCLK8" value="19"/>
              <param name="GENCLK9" value="20"/>
              <param name="GENCLK10" value="21"/>
              <param name="HSB" value="1"/>
              <param name="NUM_CLK" value="28"/>
              <param name="NUM_REF_CLK" value="4"/>
              <param name="OSC0" value="6"/>
              <param name="OSC32" value="7"/>
              <param name="PBA" value="2"/>
              <param name="PBB" value="3"/>
              <param name="PBC" value="4"/>
              <param name="PLL0" value="26"/>
              <param name="RCFAST" value="24"/>
              <param name="RCOSC" value="8"/>
              <param name="RC1M" value="25"/>
              <param name="RC32K" value="7"/>
              <param name="RC80M" value="23"/>
              <param name="REFSEL_BITS" value="2"/>
              <param name="REF_OSC32" value="1"/>
              <param name="REF_RCOSC" value="0"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
        </module>
        <module name="GLOC" id="I7551" version="1.0.2">
          <instance name="GLOC">
            <register-group name="GLOC" name-in-module="GLOC" address-space="base" offset="0x40060000"/>
            <signals>
              <signal group="IN" index="0" function="D" pad="PA06"/>
              <signal group="IN" index="0" function="D" pad="PA20"/>
              <signal group="IN" index="1" function="D" pad="PA04"/>
              <signal group="IN" index="1" function="D" pad="PA21"/>
              <signal group="IN" index="2" function="D" pad="PA05"/>
              <signal group="IN" index="2" function="D" pad="PA22"/>
              <signal group="IN" index="3" function="D" pad="PA07"/>
              <signal group="IN" index="3" function="D" pad="PA23"/>
              <signal group="IN" index="4" function="D" pad="PC15"/>
              <signal group="IN" index="4" function="C" pad="PB06"/>
              <signal group="IN" index="4" function="C" pad="PC28"/>
              <signal group="IN" index="5" function="D" pad="PC16"/>
              <signal group="IN" index="5" function="C" pad="PB07"/>
              <signal group="IN" index="5" function="C" pad="PC29"/>
              <signal group="IN" index="6" function="D" pad="PC17"/>
              <signal group="IN" index="6" function="C" pad="PB08"/>
              <signal group="IN" index="6" function="C" pad="PC30"/>
              <signal group="IN" index="7" function="D" pad="PC18"/>
              <signal group="IN" index="7" function="C" pad="PB09"/>
              <signal group="OUT" index="0" function="D" pad="PA08"/>
              <signal group="OUT" index="0" function="D" pad="PA24"/>
              <signal group="OUT" index="1" function="D" pad="PC19"/>
              <signal group="OUT" index="1" function="C" pad="PB10"/>
              <signal group="OUT" index="1" function="C" pad="PC31"/>
            </signals>
            <parameters>
              <param name="GCLK_NUM" value="5"/>
              <param name="LUTS" value="2"/>
              <param name="INSTANCE_ID" value="15"/>
            </parameters>
          </instance>
        </module>
        <module name="GPIO" id="I7512" version="2.1.5">
          <instance name="GPIO">
            <register-group name="GPIO" name-in-module="GPIO" address-space="base" offset="0x400E1000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="26" function="default" pad="PA26"/>
              <signal group="P" index="32" function="default" pad="PB00"/>
              <signal group="P" index="33" function="default" pad="PB01"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="36" function="default" pad="PB04"/>
              <signal group="P" index="37" function="default" pad="PB05"/>
              <signal group="P" index="38" function="default" pad="PB06"/>
              <signal group="P" index="39" function="default" pad="PB07"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
              <signal group="P" index="46" function="default" pad="PB14"/>
              <signal group="P" index="47" function="default" pad="PB15"/>
              <signal group="P" index="64" function="default" pad="PC00"/>
              <signal group="P" index="65" function="default" pad="PC01"/>
              <signal group="P" index="66" function="default" pad="PC02"/>
              <signal group="P" index="67" function="default" pad="PC03"/>
              <signal group="P" index="68" function="default" pad="PC04"/>
              <signal group="P" index="69" function="default" pad="PC05"/>
              <signal group="P" index="70" function="default" pad="PC06"/>
              <signal group="P" index="71" function="default" pad="PC07"/>
              <signal group="P" index="72" function="default" pad="PC08"/>
              <signal group="P" index="73" function="default" pad="PC09"/>
              <signal group="P" index="74" function="default" pad="PC10"/>
              <signal group="P" index="75" function="default" pad="PC11"/>
              <signal group="P" index="76" function="default" pad="PC12"/>
              <signal group="P" index="77" function="default" pad="PC13"/>
              <signal group="P" index="78" function="default" pad="PC14"/>
              <signal group="P" index="79" function="default" pad="PC15"/>
              <signal group="P" index="80" function="default" pad="PC16"/>
              <signal group="P" index="81" function="default" pad="PC17"/>
              <signal group="P" index="82" function="default" pad="PC18"/>
              <signal group="P" index="83" function="default" pad="PC19"/>
              <signal group="P" index="84" function="default" pad="PC20"/>
              <signal group="P" index="85" function="default" pad="PC21"/>
              <signal group="P" index="86" function="default" pad="PC22"/>
              <signal group="P" index="87" function="default" pad="PC23"/>
              <signal group="P" index="88" function="default" pad="PC24"/>
              <signal group="P" index="89" function="default" pad="PC25"/>
              <signal group="P" index="90" function="default" pad="PC26"/>
              <signal group="P" index="91" function="default" pad="PC27"/>
              <signal group="P" index="92" function="default" pad="PC28"/>
              <signal group="P" index="93" function="default" pad="PC29"/>
              <signal group="P" index="94" function="default" pad="PC30"/>
              <signal group="P" index="95" function="default" pad="PC31"/>
            </signals>
            <parameters>
              <param name="GPIO_IRQ_MSB" value="11"/>
              <param name="GPIO_MAX_IRQ_MSB" value="11"/>
              <param name="GPIO_PADDR_BITS" value="11"/>
              <param name="GPIO_PINS_MSB" value="95"/>
              <param name="IRQS_PER_GROUP" value="8"/>
              <param name="NUMBER_OF_PINS" value="96"/>
              <param name="PADDR_MSB" value="10"/>
              <param name="PDATA_MSB" value="31"/>
              <param name="PORT_LENGTH" value="3"/>
              <param name="INSTANCE_ID" value="68"/>
            </parameters>
          </instance>
        </module>
        <module name="HCACHE" id="I8323" version="1.0.1">
          <instance name="HCACHE">
            <register-group name="HCACHE" name-in-module="HCACHE" address-space="base" offset="0x400A0400"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="HMATRIXB" id="I7638" version="1.3.0">
          <instance name="HMATRIX">
            <register-group name="HMATRIX" name-in-module="HMATRIXB" address-space="base" offset="0x400A1000"/>
            <parameters>
              <param name="MASTER_NUM" value="6"/>
              <param name="MASTER_CPU_IDCODE" value="0"/>
              <param name="MASTER_CPU_SYS" value="1"/>
              <param name="MASTER_SMAP" value="2"/>
              <param name="MASTER_PDCA" value="3"/>
              <param name="MASTER_USBC" value="4"/>
              <param name="MASTER_CRCCU" value="5"/>
              <param name="SLAVE_NUM" value="8"/>
              <param name="SLAVE_FLASH" value="0"/>
              <param name="SLAVE_HTOP0" value="1"/>
              <param name="SLAVE_HTOP1" value="2"/>
              <param name="SLAVE_HTOP2" value="3"/>
              <param name="SLAVE_HTOP3" value="4"/>
              <param name="SLAVE_HRAMC0" value="5"/>
              <param name="SLAVE_HRAMC1" value="6"/>
              <param name="SLAVE_AESA" value="7"/>
              <param name="INSTANCE_ID" value="34"/>
            </parameters>
          </instance>
        </module>
