turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC4C.atdf
      <value-group name="USART_MR__USCLKS">
        <value name="MCK" caption="MCK" value="0"/>
        <value name="MCK_DIV" caption="MCK / DIV" value="1"/>
        <value name="SCK" caption="SCK" value="3"/>
      </value-group>
      <value-group name="USART_MR__MAN">
        <value name="0" caption="Manchester Encoder/Decoder is disabled" value="0"/>
        <value name="1" caption="Manchester Encoder/Decoder is enabled" value="1"/>
      </value-group>
      <value-group name="USART_MR__MODSYNC">
        <value name="0" caption="The Manchester Start bit is a 0 to 1 transition" value="0"/>
        <value name="1" caption="The Manchester Start bit is a 1 to 0 transition" value="1"/>
      </value-group>
      <value-group name="USART_MR__MSBF">
        <value name="LSBF" caption="Least Significant Bit first" value="0"/>
        <value name="MSBF" caption="Most Significant Bit first" value="1"/>
      </value-group>
      <value-group name="USART_MR__ONEBIT">
        <value name="0" caption="Start Frame delimiter is COMMAND or DATA SYNC" value="0"/>
        <value name="1" caption="Start Frame delimiter is One Bit" value="1"/>
      </value-group>
      <value-group name="USART_MR__SYNC">
        <value name="0" caption="USART operates in Synchronous Mode" value="0"/>
        <value name="1" caption="USART operates in Asynchronous Mode" value="1"/>
      </value-group>
      <value-group name="USART_MR__VAR_SYNC">
        <value name="0" caption="User defined configuration of command or data sync field depending on SYNC value" value="0"/>
        <value name="1" caption="The sync field is updated when a character is written into THR register" value="1"/>
      </value-group>
      <value-group name="USART_IER__CTSIC">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__DCDIC">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__DSRIC">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__FRAME">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__ITER">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__LINHTE">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__LINSTE">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__NACK">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__OVRE">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__PARE">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__RIIC">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__RXBRK">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__RXBUFF">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__RXRDY">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__TIMEOUT">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__TXBUFE">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__TXEMPTY">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__TXRDY">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__UNRE">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IER__MANEA">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__CTSIC">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__DCDIC">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__DSRIC">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__FRAME">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__ITER">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
