turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC4C.atdf
      <value-group name="USBC_UPCFG6__PSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UPCFG6__PTOKEN">
        <value name="SETUP" value="0"/>
        <value name="IN" value="1"/>
        <value name="OUT" value="2"/>
      </value-group>
      <value-group name="USBC_UPCFG6__PTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_UPCFG7__PBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UPCFG7__PSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UPCFG7__PTOKEN">
        <value name="SETUP" value="0"/>
        <value name="IN" value="1"/>
        <value name="OUT" value="2"/>
      </value-group>
      <value-group name="USBC_UPCFG7__PTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
      <value-group name="USBC_USBSTA__SPEED">
        <value name="FULL" value="0"/>
        <value name="HIGH" value="1"/>
        <value name="LOW" value="2"/>
      </value-group>
      <value-group name="USBC_USBFSM__DRDSTATE">
        <value name="A_IDLE" value="0"/>
        <value name="A_WAIT_VRISE" value="1"/>
        <value name="A_WAIT_BCON" value="2"/>
        <value name="A_HOST" value="3"/>
        <value name="A_SUSPEND" value="4"/>
        <value name="A_PERIPHERAL" value="5"/>
        <value name="A_WAIT_VFALL" value="6"/>
        <value name="A_VBUS_ERR" value="7"/>
        <value name="A_WAIT_DISCHARGE" value="8"/>
        <value name="B_IDLE" value="9"/>
        <value name="B_PERIPHERAL" value="10"/>
        <value name="B_WAIT_BEGIN_HNP" value="11"/>
        <value name="B_WAIT_DISCHARGE" value="12"/>
        <value name="B_WAIT_ACON" value="13"/>
        <value name="B_HOST" value="14"/>
        <value name="B_SRP_INIT" value="15"/>
      </value-group>
    </module>
    <module name="WDT" id="I7528" version="5.0.1" caption="Watchdog Timer">
      <register-group name="WDT" caption="Watchdog Timer">
        <register name="CTRL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00010080" caption="Control Register">
          <bitfield name="EN" caption="WDT Enable" mask="0x1" values="WDT_CTRL__EN"/>
          <bitfield name="DAR" caption="WDT Disable After Reset" mask="0x2"/>
          <bitfield name="MODE" caption="WDT Mode" mask="0x4"/>
          <bitfield name="SFV" caption="WDT Store Final Value" mask="0x8"/>
          <bitfield name="IM" caption="WDT Interruput Mode" mask="0x10"/>
          <bitfield name="FCD" caption="WDT Fuse Calibration Done" mask="0x80"/>
          <bitfield name="PSEL" caption="Timeout Prescale Select" mask="0x1F00"/>
          <bitfield name="CSSEL1" caption="Clock Source Selection1" mask="0x4000"/>
          <bitfield name="CEN" caption="Clock Enable" mask="0x10000"/>
          <bitfield name="CSSEL" caption="Clock Source Selection0" mask="0x20000"/>
          <bitfield name="TBAN" caption="TBAN Prescale Select" mask="0x7C0000"/>
          <bitfield name="KEY" caption="Key" mask="0xFF000000"/>
        </register>
        <register name="CLR" offset="0x4" rw="W" size="4" access-size="4" initval="0x00000000" caption="Clear Register">
          <bitfield name="WDTCLR" caption="Clear WDT counter" mask="0x1"/>
          <bitfield name="KEY" caption="Key" mask="0xFF000000"/>
        </register>
        <register name="SR" offset="0x8" rw="R" size="4" access-size="4" initval="0x00000003" caption="Status Register">
          <bitfield name="WINDOW" caption="WDT in window" mask="0x1"/>
          <bitfield name="CLEARED" caption="WDT cleared" mask="0x2"/>
        </register>
        <register name="IER" offset="0xC" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="WINT" caption="Watchdog Interrupt" mask="0x4"/>
        </register>
        <register name="IDR" offset="0x10" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="WINT" caption="Watchdog Interrupt" mask="0x4"/>
        </register>
        <register name="IMR" offset="0x14" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="WINT" caption="Watchdog Interrupt" mask="0x4"/>
        </register>
        <register name="ISR" offset="0x18" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="WINT" caption="Watchdog Interrupt" mask="0x4"/>
        </register>
        <register name="ICR" offset="0x1C" rw="W" size="4" access-size="4" atomic-op="clear:ISR" initval="0x00000000" caption="Interrupt Clear Register">
          <bitfield name="WINT" caption="Watchdog Interrupt" mask="0x4"/>
        </register>
        <register name="VERSION" offset="0x3FC" rw="R" size="4" access-size="4" initval="0x00000501" caption="Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
      </register-group>
